Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G01A.tmx
Source language: en_us
Languages: zh_cn

source: PHILIP LAID BARE
zh_cn: 菲利普亲王的传奇故事

source: Natural athlete: Prince Philip waterskiing in 1951
zh_cn: 天生的运动员：菲利普亲王在滑水，1951年

source: A funny thing happened on the way to the Abbey.
zh_cn: 在去修道院的路上发生了一件有趣的事情。

source: Whenever Prince Philip, Duke of Edinburgh, was in view during last month's Royal Wedding, he was applauded as wildly as the Queen herself.
zh_cn: 当爱丁堡的公爵，菲利普亲王在上个月举行皇家婚礼的时候，赢得了包括女王在内的所有人的喝彩。

source: It seemed to set the seal on his new relationship with the British public: one of unqualified affection.
zh_cn: 这看似是要确定他与英国公众的新关系——这是一种有些不融洽的感情。

source: The tetchy comments and caustic asides no longer give any more offence than a great-grandfather muttering by the fireside.
zh_cn: 那些敏感言论和刻薄的旁白在曾祖父的非正式的发牢骚的对比之下，都不再具有攻击性。

source: Prince Philip, stiff-backed and sprightly as he turns 90 today, has become an institution, applauded for giving support and encouragement to the Queen over a period of more than 60 years, thus making him the longest-serving royal consort in British history.
zh_cn: 菲利普亲王，在他即将90岁的今天依然站的笔直且活泼，这已经成为了一个习惯，他因为在长达60年的婚姻时光中支持并鼓励着女王而受到称赞，从而使他成为英国历史上在位时间最长皇家的伴侣。

source: Yet as Philip Eade demonstrates in this highly readable biography of Prince Philip's first 30 years, this extraordinary man endured a childhood of such turmoil that nowadays the social services would have placed him in care.
zh_cn: 但是Philip Eade证明，在菲利普亲王前30年的非常不同寻常的生活中，这个非凡的男人忍受了童年时期多少的痛苦，那些如果放到今天是可以受到社会福利的。

source: He was born in June 1921, the youngest of five children, at a time when thrones and principalities were being toppled like ninepins across Europe.
zh_cn: 他出生于1921年6月，是家中五个孩子中最小的一个，那时座天使和权天使摇摇欲坠，就像其木柱滚过欧洲。

source: Mired in bloody revolutions, Philip's father Andrea, a member of the Greek royal family and first cousin of George V, only narrowly escaped Greece with his life.
zh_cn: 踱步在血腥的革命中的菲利普的父亲，安德里亚，是希腊皇室的一员，也是乔治五世的第一代堂兄，只身一人勉强逃离希腊。

source: Traumatised, he left his children behind to be looked after by his wife's family and lived a playboy existence around Europe's watering-holes.
zh_cn: 创伤后，他把孩子们留给她妻子的家人们看管，自己便在欧洲各处的酒吧过着纨绔子弟的生活。

source: Philip's beautiful, affectionate mother, who was born deaf, succeeded in getting her five children out of Greece but became increasingly dotty, blessing her teacup and leaping out of a clinic window with a bundle of laundry.
zh_cn: 菲利普的美丽的，慈爱的母亲，先天失聪，她成功的带着五个孩子逃出希腊，但是变得越来越虚弱，她为茶碗祷告后带着一包衣服从诊所窗户跳了出来。

source: She was committed to an asylum when Philip was nine.
zh_cn: 当菲利普九岁的时候，她就进入了收容所。

source: Philip was doubly homeless.
zh_cn: 菲利普就更无家可归了。

source: His Danish grandfather had been invited to become King of Greece: he himself had no Greek blood.
zh_cn: 他的丹麦人祖父曾经被邀请成为希腊的国王：他自己没有希腊的血统。

source: Yet for much of his school life he was known simply as Greece, which must have confused fellow pupils staring at his bright blue eyes and flaxen hair.
zh_cn: 但是在学校的时候，他只是被简单的认为是希腊人，这就总让他那些疑惑的同学盯着他的浅蓝色眼睛和亚麻色头发。

source: From the age of nine, until he moved into Clarence House as Princess Elizabeth's husband, he had no fixed place he could call home.
zh_cn: 自从九岁开始，直到他作为伊丽莎白公主的丈夫住进Clarence House，他连一个可以被称之为家的地方都没有。

source: Instead he moved between his extended family, such as his distant cousins the Milford Havens.
zh_cn: 反而，他在他的大家族中不停周转，比如说他的远房表亲Milford Havens。

source: He went to school first at Cheam and then in 1933 to Salem in Germany, where most of his family actually originated.
zh_cn: 他最开始在Cheam上的学，再1933年又去了德国的Salem，他家族最开始起源于那里。

source: At Salem he came under the influence of philosopher Kurt Hahn, a charismatic figure who had a great influence on Philip and, much later on his own son, Prince Charles.
zh_cn: 在礼拜堂他收到了哲学家Kurt Hahn的影响，那是一个天赋异禀的人，他对菲利普和之后他的儿子——查尔斯王子都有着深刻的影响。

source: A fine athlete: Prince Philip collecting the Dowdray Park Gold Cup
zh_cn: 不错的运动员：菲利普亲王得到了Dowdray公园金奖杯

source: Eade is right to devote several pages to this strange figure.
zh_cn: Eade对这个奇怪的人做了些贡献是正确的。

source: He was a throwback to the Victorian era when it was thought moral decay had to be combated by a regime of fitness for the mind and body.
zh_cn: 他是维多利亚时代的一个大逆转，那个时候普遍认为道德沦丧必须靠强健的身体素质和心理素质来改变。

source: Boys had to run a quarter of a mile before breakfast, drink milk at meals and do exercises while teachers read to them.
zh_cn: 男孩子们必须在早餐前跑上四分之一英里，每餐必须喝牛奶，当老师教书的时候也要做练习。

source: This regime, which suited Philip, a fine athlete, might have encompassed all his education.
zh_cn: 这种社会制度陪伴菲利普走过整个学生时代，它对菲利普倒是很适合——他有很好的运动神经。

source: But Hahn was a Jew, and was forced to flee Germany.
zh_cn: 但是Hahn是犹太人，他被迫逃出了德国。

source: Salem turned itself over to the Hitler Youth, and the school had to be recreated in Scotland, at Gordonstoun, where 'Greece' received a slightly wider education.
zh_cn: 礼拜堂变成了希特勒青年团，然后学校只能在苏格兰重建，在戈登斯顿，在那里“希腊人”才得到了范围稍微广一点的教育。

source: It could easily have gone the other way.
zh_cn: 其实很可能有另外一个结局。

source: The presence of the young Prince Philip in Germany played to Hitler's interests, and several members of his family served the Third Reich.
zh_cn: 在德国的年轻的菲利普亲王的存在迎合了希特勒的口味，然后他的家族的一些成员服务于第三帝国。

source: Yet although Philip had strong ties both to his German relatives and to Greece (where he was briefly second in line to the throne), he felt most at home in England.
zh_cn: 然而，尽管菲利普与德国和希腊都有这很深的联系（在希腊他一度成为君主的第二继承人），他仍然感觉在英国最有家的感觉。

source: The Milford Havens were his surrogate family, and when his closest friend Georgie Milford Haven died of cancer in 1938 he wrote in his diary the single word: 'Heartbroken.'
zh_cn: 收养他的家庭在米尔福德港，当1983年，他在那里最好的朋友Georgie因患癌症去世的时候，他在日记中只写了一个词：“心碎”。

source: It was one of many tragedies in his young life, and it seems to have resulted in what psychologists call a 'highly defended' personality - hard-nosed and screened against others' emotions.
zh_cn: 这是他在年轻时代经历的许多不幸中的一个，而这似乎导致了他的在心理学上的“高度防御”人格，有重视实际，习惯与人保持距离的情感特点。

source: His new mentor was his uncle, Lord Mountbatten.
zh_cn: 他叔叔蒙巴顿成为了他新的良师益友。

source: They were alike in many ways - forthright, undemonstrative, sometimes irritable, but also kind - and Philip became like a son to the great man.
zh_cn: 他们在许多地方都很相似——直率，含蓄，有时有些暴躁，但也很善良——菲利普像是那位大人物的儿子一样。

source: A national treasure: Prince Philip's support for the Queen has earned him the nation's affection
zh_cn: 国家财富：菲利普亲王对女王的支持赢得了全国人民的赞赏

source: It was at that time, July 1939, that the future Queen Elizabeth first set eyes on this glamorous figure.
zh_cn: 就是在1939年7月的时候，英国未来的女王伊丽莎白一世看上了这个富有魅力的男人。

source: Since Greece was neutral in World War II he was forbidden active service until August 1940 when Greece joined the Allies; his first engagement, off Cape Matapan, effectively scuppered the Italian fleet and earned Philip a mention in dispatches.
zh_cn: 自从希腊在二战时表示中立，他就被禁止服役，直到1940年8月希腊加入同盟国。他的第一次参战在马塔潘角海战，他有效的突袭了意大利舰队，这让他在战报中得到了表扬。

source: There were other conquests to be made, during and after the War.
zh_cn: 在这场战役之中和之后，他还有其他的战利品。

source: Consummately eligible and dashingly handsome, Philip was connected to several beautiful women.
zh_cn: 各种条件优秀又英俊，菲利普被介绍给好几个美丽的女子。

source: One was dark-haired Canadian beauty Osla Benning, whom he squired around London; another, many years later, was Pat Kirkwood, a musical comedy star whose legs were pronounced 'the eighth wonder of the world'.
zh_cn: 其中一个是黑头发的加拿大女孩Osla Bennington，是他在伦敦侍卫的人；很多年后的另一个是Pat Kirkwood，是一个腿被称为“世界第八大奇迹”的歌舞戏剧明星。

source: Both of them, and several other women known to have had trysts with Philip, have poured scorn on any rumours of an affair, claiming that back in those days women were either too ignorant or too well brought up to have sex - and Eade has to take their word for it.
zh_cn: 她们两个，和另外几位与菲利普有过绯闻的事不屑一顾，声称在那个年纪的女人要么太无知，要么只是为了性——Eade不得不相信她们的话。

source: Meanwhile, with the war at an end, Philip, with no particular place to go, was thrown back on his naval pay of around ?300 a year.
zh_cn: 与此同时，战争结束了，Philip没有特别的地方去，就被扔回到年薪?300的海军队伍中。

source: To make ends meet, he would travel by bus and press his own trousers under the mattress at night.
zh_cn: 为了维持生计，他只能坐巴士出行，晚上睡觉的时候用自己的衣服当被褥。

source: One courtship was going great guns.
zh_cn: 婚约不期而至。

source: Elizabeth had fallen for Philip almost from the day they met.
zh_cn: 伊丽莎白几乎是从他们第一次见面就爱上了他。

source: He was handsome, boisterous, somehow more vivid than other suitors the King and Queen had lined up for Lisbet, such as Hugh Euston, Johnny Dalkeith and the Duke of Marlborough.
zh_cn: 他是那么英俊，狂暴，不知为何比那些国王和王后想要得到的追求者（比如Hugh Euston, Johnny Dalkeith和Marlborough公爵）鲜活许多。

source: The courtiers, almost to a man, regarded Philip as 'no gentleman - hang it all, he hadn't even gone to Eton'.
zh_cn: 朝臣们几乎每个都惹你为菲利普“不是绅士——岂有此理，他甚至都没去过伊顿”。

source: Philip's connection with the power-seeking Mountbattens did not make things easier; nor did the need for his naturalisation as British before he could be accepted by the public.
zh_cn: 菲利普与正在寻求势力的蒙巴顿的关系并没有把事情变简单，在他被大众接受前归入英国国籍也是不需要的。

source: And though love conquered all, as the happy months after their Royal Wedding illustrated, being consort to the Queen, after George VI's death, was harder than Philip expected.
zh_cn: 尽管后来真爱征服了一切，在他们的皇家婚礼进行后的快乐的几个月之后，乔治五世去世，他成为了女王的伴侣，这之后的生活比他预想的要更艰辛。

source: He had to accept numerous slights: friction with courtiers who found him abrasive, and the giving up of a house of their own to move into a flat in the Palace.
zh_cn: 他不得不接受很多事情：与认为他不够高贵的朝臣之间的摩擦，还要放弃本来属于自己的一栋房子，搬进王宫里住。

source: Worst of all for him was that both Churchill and the Palace insisted on keeping the name House of Windsor, not changing it to Mountbatten or Battenburg.
zh_cn: 对他来说最糟糕的事是，丘吉尔和Palace都坚持保留使用“温莎皇室”的名称，而不变更成蒙巴顿或Battenburg。

source: 'I am the only man in the country not allowed to give his name to his children,' he raged.
zh_cn: “我是这个国家唯一一个不能把名字传给子孙的人，”他怒喝道。

source: 'I'm nothing but an amoeba!'
zh_cn: “我啥都不是，就是一个变形虫！”

source: All this could have fostered a climate of bitterness between the couple.
zh_cn: 这些事情都在他们夫妇二人中制造了辛酸的情绪。

source: But there was none.
zh_cn: 但是没有办法。

source: Elizabeth rode the storms. Philip helped her overcome her shyness.
zh_cn: 伊丽莎白顺利度过困境，而菲利普帮助她克服她的胆怯。

source: This balanced, sympathetic, engaging book deserves to take is place among the first rank of modern Royal biographies.
zh_cn: 这本和谐，感人，吸引人的书当之无愧的属于一流的现代皇家传记。
